{"pages":[{"title":"about","text":"这是一段测试文字，主要测试about界面是否生效","link":"/about/index.html"}],"posts":[{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2022/07/01/hello-world/"},{"title":"Hexo搭建部署至Github","text":"最近折腾Blog折腾到了Hexo上，写这篇文章主要目的分享自己部署在Github上的坑，另外一个原因是Hexo是本地推送然后生成静态页面，搞不好那天本地环境折腾出问题了还得重新来过，所以记录下部署过程以防备忘（健忘） 环境配置安装Git安装Git，下载完成后基本一路点到底，安装完成后右键菜单会有Git Gui Here 和 Git Bash Here 安装Node.js因为Hexo是基于Node.Js的环境，所以我们需要安装Node.Js以方便本地调试，官网的Node.Js因线路问题安装包下载较慢 建议使用NodeJs中文网安装最新的”长期支持版本”即可，点击后根据本机系统选择相应的安装包下载完成后安装即可 安装完成后在Cmd 输入 node-v 提示安装版本号（V16.16.0）即代表安装成功 Git仓库和SSH配置关联Github账号&amp;邮箱在桌面右键，点击Git Bash Here，出现Git命令行弹窗 在弹窗内分别输入以下两行命令，并回车运行 123git config --global user.name &quot;此处填写你的github用户名&quot;git config --global user.email &quot;此处填写你的github注册邮箱&quot;#注意这里 user.name &amp; user.email 都是命令行本身，需要输入的内容在&quot;&quot;之间 输入完成后一般没有反应然后去本地文件，路径为 C:/Users/[username]/.gitconfig （未找到的话建议开启隐藏文件或换一个用户名尝试搜索文件.gitconfig，找到该文件后打开里面有刚才输入的用户名和邮箱即配置成功 配置Github仓库关联SSH首先在Github创建一个”用户名.github.io”的仓库，例如：SuperLed.github.io，创建完成后我们关联SSH用来授权本地和仓库的权限 打开Git Bash Here命令行窗口 输入命令：Cd ~/.ssh 来创建一个本地密匙 创建完成后，会在本地生成id_rsa_id_rsa.pub，该文件存放在 C:\\Users\\admin.ssh","link":"/2022/07/01/Hexo-Github/"},{"title":"致小A8.1","text":"小A是我的朋友曾经喜欢过的一位女生，我的朋友叫面包跟我很像的经历的地方就是都是在武汉见面之后分开了我更喜欢将我自己抽离出来，将你抽离出来来写东西，这样你也许能更好的感受到所以下面 面包 可能说的是我，小A可能是你面包从未感受到来自亲密关系里如此大的恶意，他最好的办法也许是保持沉默，远离小A，面包总是在那个时候满脑子没法清楚理智的思考事情，但是他想表达出他想说的又非常的困难，他总是先让自己疏离才能表达出来 面包其实不反感自己做什么事情去告诉别人，只是他还是比较了解小A对面包的起心是藏裹起来且某些负能量的事情感到害怕，甚至攻击，面包觉得没办法在知道这些以后还告诉小A，小A和面包生活了两年，但是他们不是太如意，总是吵架，争吵，混乱的信息充斥着面包的大脑，他感觉他腐烂的面目全非了，而不是让他升华了，面包深知自己很难对于小A的言行忤逆自己真实的人性，但她了解小A的善良，温柔，他想把最好的一面带给小A，即使小A会在某些时候不顾一切的指责他，小A怪他不敢承认，害怕别人的声音，面包不敢作声，但是又不得不顺延着暴力的沟通继续，他从来不是害怕别人怎么看他，指责他，而是他害怕这样的小A，这样聊下去小A又会远离他，面包不想让事情继续乱下去了，就像在武汉跟小A的朋友一样，他去回应的时候下意识的就想到了小A以后回来了该怎么面对小A的朋友，他不敢面对，因为至少在武汉时小A和她的好朋友都不太喜欢面包，面包心里明白如果小A跟自己没有共识，说什么都只会让事情越来越乱，面包傲慢的觉得只有自己最懂得小A，他不想跟任何人再去解释小A了，面包想到了小A的眼泪，想到了家人，想到了他和小A定义的喜欢对方是要怎么做，面包总是清楚自己是在倾诉，别人说的话是在分裂她去怎么看小A还是去做什么，他厌烦这种割裂感，他只想和小A单独的聊这些 面包思考了和小A，如果小A选择和别人在一起，自己还是要继续生活，只不过他内心依旧清楚的知道，小A的缺点，小A的不完美，小A的性子，面包知道小A可能没法完全相信他，所以小A在这两年一直害怕暴露自己，总觉得说出来自己的脆弱就会被人任人宰割，没法保证自己的安全，即使那个人不是面包，小A也无法做到这些，所以面包经常告诉自己，无论怎么样他依旧愿意牵着小A的手走下去，面包清楚的知道，自己只要背负着自己的一些恶意和卑略，把善意和最好的一面给她，即使选择欺骗，他也愿意相信，某一天小A愿意接受他，对生活和面包充满了信心和希望，即使面包已经决定自己不会再依靠任何人来给予自己安全感了，面包非常喜欢小A对她分享自己的世界，面包临近合好的时候被她占据了大脑，他只是这很苍白，但是他知道小A知道，她明白某种疯狂 面包对小A说的话即痛苦又觉得乏味，小A说他是假的深情，自卑，甚至会觉得他脚踏几只船，养备胎，面包无所说起，觉得难过又沉重，又一股难以解释的言语在身体上，他总觉得小A明知道他不会，他不是那样的目的或者出发点，可是他一时想不明白，也没有时间整理自己琐碎的语言，面包回想小A那些愤怒的话中，面包觉得小A在厌恶自己的不完美，小A总是今天说 你要因为是我而喜欢我，而不是一些其他美好的品质，但实际上小A又会产生反感，面包开始对小A的指责感到乏味，小A只是想让自己觉得不会碰到一个真正愿意喜欢她的人罢了，面包觉得解释会很苍白，小A看起来已经完全否定他了，但是他又明白小A自己表达的混乱，小A的脆弱，可是面包觉得他现在又能说什么的，感觉任何话都会被瞬间抹平，认定他就是某一种人，小A暂时不会想起那些琐碎的话 小A遇到了小C，这让面包异常的难过，面包只能通过一些刺激去麻痹自己，至于小C，他是一位律师，他人非常友好，他对未来的生活规划和一切都安排妥当，最重要的是小C带给了小A一些美好的东西，也许是暧昧，也许是某些美好未来，尽管认识的时间很短，但让小A依旧感觉非常的美好，但小A依旧觉得内心充满了强烈的孤独感，她以为小C可以让她不会再有这种感受，可以填充她内心的这些，但不知为何会这样 在面包心里，他觉得小A真的很厉害，很漂亮，但是面包一点都不害怕小A没有这些东西，因为面包总是能看到本质，也许那个人不是小A也能看到，于是小A离开了面包，面包开始抓狂，找其他人，否认这一切，告诉别人多恨小A，小A一点都不好，上个那么好的学校这点人情世故都不懂，面包试图忘了小A，面包不想看到小A的本质，面包想麻痹让自己觉得她是个坏女人，试图用这些把其他的种种理解种种事情全部掩埋，这样好让他忘掉让他痛苦的小A，他觉得小A已经走了，就麻痹自己去接着过混蛋的生活吧 面包觉得自己总需要从小A混乱的信息中抽离出来，才能清醒的看待这些事情他希望小A无论觉得自己是怎么样的人，都希望小A能接纳自己","link":"/2022/08/01/%E8%87%B4%E5%B0%8FA/"}],"tags":[{"name":"Hexo","slug":"Hexo","link":"/tags/Hexo/"},{"name":"Git","slug":"Git","link":"/tags/Git/"}],"categories":[{"name":"Development","slug":"Development","link":"/categories/Development/"}]}