{"pages":[{"title":"about","text":"这是一段测试文字，主要测试about界面是否生效","link":"/about/index.html"}],"posts":[{"title":"Hexo搭建部署至Github","text":"最近折腾Blog折腾到了Hexo上，写这篇文章主要目的分享自己部署在Github上的坑，另外一个原因是Hexo是本地推送然后生成静态页面，搞不好那天本地环境折腾出问题了还得重新来过，所以记录下部署过程以防备忘（健忘） 环境配置安装Git安装Git，下载完成后基本一路点到底，安装完成后右键菜单会有Git Gui Here 和 Git Bash Here 安装Node.js因为Hexo是基于Node.Js的环境，所以我们需要安装Node.Js以方便本地调试，官网的Node.Js因线路问题安装包下载较慢 建议使用NodeJs中文网安装最新的”长期支持版本”即可，点击后根据本机系统选择相应的安装包下载完成后安装即可 安装完成后在Cmd 输入 node-v 提示安装版本号（V16.16.0）即代表安装成功 Git仓库和SSH配置关联Github账号&amp;邮箱在桌面右键，点击Git Bash Here，出现Git命令行弹窗 在弹窗内分别输入以下两行命令，并回车运行 123git config --global user.name &quot;此处填写你的github用户名&quot;git config --global user.email &quot;此处填写你的github注册邮箱&quot;#注意这里 user.name &amp; user.email 都是命令行本身，需要输入的内容在&quot;&quot;之间 输入完成后一般没有反应然后去本地文件，路径为 C:/Users/[username]/.gitconfig （未找到的话建议开启隐藏文件或换一个用户名尝试搜索文件.gitconfig，找到该文件后打开里面有刚才输入的用户名和邮箱即配置成功 配置Github仓库关联SSH首先在Github创建一个”用户名.github.io”的仓库，例如：SuperLed.github.io，创建完成后我们关联SSH用来授权本地和仓库的权限 打开Git Bash Here命令行窗口 输入命令：Cd ~/.ssh 来创建一个本地密匙 创建完成后，会在本地生成id_rsa_id_rsa.pub，该文件存放在 C:\\Users\\admin.ssh","link":"/2022/07/01/Hexo-Github/"},{"title":"致小A 8.1","text":"小A是我的朋友曾经喜欢过的一位女生，我的朋友叫面包跟我很像的经历的地方就是都是在武汉见面之后分开了我更喜欢将我自己抽离出来，将你抽离出来来写东西，这样你也许能更好的感受到所以下面 面包 可能说的是我，小A可能是你面包从未感受到来自亲密关系里如此大的恶意，他最好的办法也许是保持沉默，远离小A，面包总是在那个时候满脑子没法清楚理智的思考事情，但是他想表达出他想说的又非常的困难，他总是先让自己疏离才能表达出来 面包其实不反感自己做什么事情去告诉别人，只是他还是比较了解小A对面包的起心是藏裹起来且某些负能量的事情感到害怕，甚至攻击，面包觉得没办法在知道这些以后还告诉小A，小A和面包生活了两年，但是他们不是太如意，总是吵架，争吵，混乱的信息充斥着面包的大脑，他感觉他腐烂的面目全非了，而不是让他升华了，面包深知自己很难对于小A的言行忤逆自己真实的人性，但她了解小A的善良，温柔，他想把最好的一面带给小A，即使小A会在某些时候不顾一切的指责他，小A怪他不敢承认，害怕别人的声音，面包不敢作声，但是又不得不顺延着暴力的沟通继续，他从来不是害怕别人怎么看他，指责他，而是他害怕这样的小A，这样聊下去小A又会远离他，面包不想让事情继续乱下去了，就像在武汉跟小A的朋友一样，他去回应的时候下意识的就想到了小A以后回来了该怎么面对小A的朋友，他不敢面对，因为至少在武汉时小A和她的好朋友都不太喜欢面包，面包心里明白如果小A跟自己没有共识，说什么都只会让事情越来越乱，面包明白越来越乱，只会让小A回来的路上充满阻拦，她届时不得不面对各种各样的让她消极的事情，所以面包觉得他们自己的事情要自己解决，可是当他越强调，小A像着了魔一样，总是把她的朋友推到最前面，面包届时觉得自己肯定要去承担这些了，不过所有的一切都要看小A的意思，只要她愿意，其他都没太大的所谓，面包傲慢的觉得只有自己最懂得小A，他不想跟任何人再去真正的解释小A了，小A的表面，小A的内心，别人只会根据当时随口说两句，随心的话，而不用负一点责任，面包觉得很无奈，面包想到了小A的眼泪，想到了家人，想到了他和小A定义的喜欢对方是要怎么做，面包总是清楚自己是在倾诉，别人说的话是在分裂她去怎么看小A还是去做什么，他厌烦这种割裂感，他只想和小A单独的聊这些 面包思考了和小A，如果小A选择和别人在一起，自己还是要继续生活，只不过他内心依旧清楚的知道，小A的缺点，小A的不完美，小A的性子，面包知道小A可能没法完全相信他，所以小A在这两年一直害怕暴露自己，总觉得说出来自己的脆弱就会被人任人宰割，没法保证自己的安全，即使那个人不是面包，小A也无法做到这些，所以面包经常告诉自己，无论怎么样他依旧愿意牵着小A的手走下去，面包清楚的知道，自己只要背负着自己的一些恶意和卑略，把善意和最好的一面给她，即使选择欺骗，他也愿意相信，某一天小A愿意接受他，对生活和面包充满了信心和希望，即使面包已经决定自己不会再依靠任何人来给予自己安全感了，面包非常喜欢小A对她分享自己的世界，面包临近合好的时候被她占据了大脑，他只是这很苍白，他觉得愧对那些人，他需要面对，他知道她明白，只是不知道她选择悲观的时候选择更加混乱，她明白，他明白 面包对小A说的话即痛苦又觉得乏味，小A说他是假的深情，自卑，甚至会觉得他脚踏几只船，养备胎，面包无所说起，觉得难过又沉重，又一股难以解释的言语在身体上，他总觉得小A明知道他不会，他不是那样的目的或者出发点，可是他一时想不明白，也没有时间整理自己琐碎的语言，面包回想小A那些愤怒的话中，面包觉得小A在厌恶自己的不完美，小A总是今天说 你要因为是我而喜欢我，而不是一些其他美好的品质，但实际上小A又会产生反感，面包开始对小A的指责感到乏味，小A只是想让自己觉得不会碰到一个真正愿意喜欢她的人罢了，面包觉得解释会很苍白，小A看起来已经完全否定他了，但是他又明白小A自己表达的混乱，小A的脆弱，可是面包觉得他现在又能说什么的，感觉任何话都会被瞬间抹平，认定他就是某一种人，小A暂时不会想起那些琐碎的话 小A遇到了小C，这让面包异常的难过，面包只能通过一些刺激去麻痹自己，至于小C，他是一位律师，他人非常友好，他对未来的生活规划和一切都安排妥当，最重要的是小C带给了小A一些美好的东西，也许是暧昧，也许是某些美好未来，尽管认识的时间很短，但让小A依旧感觉非常的美好，但小A依旧觉得内心充满了强烈的孤独感，她以为小C可以让她不会再有这种感受，可以填充她内心的这些，但不知为何会这样 在面包心里，他觉得小A真的很厉害，很漂亮，但是面包一点都不害怕小A没有这些东西，因为面包总是能看到本质，也许那个人不是小A也能看到，于是小A离开了面包，面包开始抓狂，找其他人，否认这一切，告诉别人多恨小A，小A一点都不好，上个那么好的学校这点人情世故都不懂，面包试图忘了小A，面包不想看到小A的本质，面包想麻痹让自己觉得她是个坏女人，试图用这些把其他的种种理解种种事情全部掩埋，这样好让他忘掉让他痛苦的小A，他觉得小A已经走了，就麻痹自己去接着过混蛋的生活吧 面包觉得自己总需要从小A混乱的信息中抽离出来，才能清醒的看待这些事情他希望小A无论觉得自己是怎么样的人，都希望小A能接纳自己，","link":"/2022/08/01/%E8%87%B4%E5%B0%8FA/"},{"title":"关于客体恒常性的总结","text":"前段时间看了一些关于客体恒常性的书籍《依恋》《人格心理学》，想结合看完的浅谈下写下一些备忘总结 简单介绍一下客体恒常性的概念，大概意思就是，我们和内心的”客体”有一种安宁恒定的状态，就好比对于父母离开的家的独处的孩子来说。 如果正常稳定的客体，会让我们觉得父母虽然不在，孩子虽然会想父母，但是他会感到他和父母心里仍然在一起。 反之缺失的话会产生会焦虑、焦躁、害怕被抛弃的情绪。 造成客体缺失的原因有很多，童年不友好的客体分离体验，成长经历中被忽冷忽热的对待，亲朋好友的逝世。 目前了解和学习客体恒常性就我自身而言独处时感到安宁有很大的帮助，我不再像之前那样独处时会有很多侵入性的想法。 关于客体恒常性的定义？客体和主体呈相对视角，主体也就是我们的内心视角感，而客体意指我们主体的内心视角所看到依恋目标所指的对象。 而恒常性就比较字面意思了，是我们理解了依恋目标，且知道对我们充满爱意，与我们较好的维系情感上的链接时，我们会把 依恋目标转换为一个”内在的客体形象”，即便监护人，伴侣暂时离开了我们，我们也知道他们只是暂时的离开了我们的视野 没有抛弃我们或者消失了，我们仍然知道我们是被爱的，被支持的。 客体的缺失和影响对于不能安全依恋的来说，任何的分离，哪怕是短暂的，也会触发他们再次体验到被抛弃，拒斥，贬低的痛苦 这种原生的痛苦会迫使人去做出相应的行为，比如粘人、回避、否认、甚至攻击伤害对方，或者通过强行破坏关系保持距离感来避免这种伤害。 缺失客体恒常性的人，在和他人相处时，更倾向于把对带依恋目标带有不稳定性，即很难看待客体的和主体都有好的一面和坏的一面，对关系的体验 是极其不可靠，脆弱的，关系时好时坏很大程度上取决于当时的情绪、心情的好坏，看待伴侣，依恋目标的视角似乎没有连续性，时刻因为一时的情绪 进行着变化，时而好时而坏，经常会导致根据当下的情绪做一些让自己后悔的决定 而这种不稳定则很大程度来源于，童年不好的体验，父母时而奖励，时而打压从而导致了 无法真正享受与别人的联结感。由于无法保留内在客体，他们对他人的评价也经常动摇，只是基于他人当下的表现和自己当下的感受，也无法容忍他人偶尔的过失，可以说缺乏信任的能力，也无法真正意义上享受长期稳定深入的联结感 一个人没有能力把他人当做一个恒常的整体，那么当所爱之人不在身边时，就很难再有爱人仍在的感觉，被孤零零的丢下的感觉如此强烈，难以承受，以至于会激起一些原始的、强烈的，有时甚至是孩子气的反应。被抛弃的恐惧一旦被触发，羞耻感和自我谴责会紧随其后，进一步破坏这个已经焦虑的人的情绪。由于这些强烈反应的起点不总是在意识层面，所以有时候一个人的行为看起来好像是在“无理取闹”或者“不成熟”。事实上，如果我们明白他们的行为源于被压抑或者被解离的创伤（想想一个2岁的孩子被独自丢下或者跟一个反复无常的照料者一起生活是什么样子），那么，那些强烈的恐惧、愤怒，以及绝望就都说得通了 如何疗愈、治愈客体缺失感首先对自己和他人，如果既能看到优点也能看到缺点，我们就不必使用“分裂”的原始防御，也无需抱有非黑即白的想法。即使伴侣让我们完全失望，也不必贬低他们。我们也能原谅自己。因为，不是一直都完美并不意味着我们就有缺陷，不值得被爱 他们生我们气的同时也可以爱着我们。 他们或许有时候需要远离我们，但彼此之间的连接基础是牢固的。 被抛弃的恐惧过于强烈是因为它勾起了我们从小一直背负的痛彻心扉的创伤：被丢在世上，弱小无助，只能依赖周围人。但我们必须明白，那些恐惧与当下的现实无关。尽管生活中没有绝对的确定与安全，但我们如今已经长大成人，可以做出不一样的选择。 作为一个成年人，我们可以选择不再“被抛弃”，一段关系结束了，就只是两个人在价值观、需要等方面不匹配，各自选择了不同的人生道路，结束是自然而然的事。 我们可以选择不再“被拒绝”，别人的评价不能左右我们存在的价值。我们可以选择不被吞没，不受制于人。我们可以说不，可以设定边界，也可以走开。 作为一个有弹性的成年人，我们可以抚慰内心深处那个只有两个月大的自己，那个自己非常害怕被人丢弃，我们学着与自己的身体在一起，哪怕充满恐惧，也不要解离，我们也能与他人待在一段关系里，哪怕其中有不确定，我们也不逃离、不回避、不防御 《思维取代思绪》（Mind over Mood）七步方法： 第一步 情况：现在让你出现强烈情绪的场景。eg.恋人离开家，出差五天。 第二步 情绪：现在的情绪。eg.害怕、焦虑和恐慌。 第三步 自然涌现的想法：因为这个场景你自然而然对于他人和自己的一些看法。eg.他抛下了我。我不值得被爱。 第四步 支持这些想法的证据：实实在在发生的事情让你觉得这些想法是事实。eg.他没有说到底什么时候回来，而且我一直没收到他的信息。 第五步 不支持这些想法的证据：实实在在发生的事情让你觉得还存在第二种可能性。eg.他一直都很在意我的感受，而且走之前说了事情结束后会尽快回来。 第六步 平衡后的想法：在对比了两方面的证据后产生的新想法。eg.他一直不发短信给我是不好的，但是很有可能不是他不想理我，而是暂时抽不开身。 第七步 评价现在的情绪：有没有变化或有没有产生新的情绪。eg.挂念和担心，而不是无法承受的恐慌。 被丢弃、被独自留下的创伤已经过去，愿你我都能日渐成长为更为安宁的人。","link":"/2022/08/01/%E5%85%B3%E4%BA%8E%E5%AE%A2%E4%BD%93%E6%81%92%E5%B8%B8%E6%80%A7%E7%9A%84%E6%80%9D%E8%80%83%E5%92%8C%E6%80%BB%E7%BB%93/"}],"tags":[{"name":"Hexo","slug":"Hexo","link":"/tags/Hexo/"},{"name":"Git","slug":"Git","link":"/tags/Git/"},{"name":"心理健康","slug":"心理健康","link":"/tags/%E5%BF%83%E7%90%86%E5%81%A5%E5%BA%B7/"}],"categories":[{"name":"Development","slug":"Development","link":"/categories/Development/"}]}